content/topics/hugo.md
+++
title = "hugo"
tags = ["hugo"]
draft = false
+++

## Themes I like {#themes-i-like}

-   2022-08-22 ◦ [Hugo Theme Fuji - A minimal Hugo theme.](https://github.dsrkafuu.net/hugo-theme-fuji/)


## Customizations {#customizations}


### Posts {#posts}

-   2022-08-22 ◦ [Divide post list by year in Hugo · DigitalNotions](https://digitalnotions.net/divide-post-list-by-year-in-hugo/)


### Backlinks {#backlinks}

-   2022-08-22 ◦ [Parsing Backlinks in Hugo ❚ A Scripter's Notes](https://scripter.co/parsing-backlinks-in-hugo/)


## Integrations {#integrations}


### getpocket {#getpocket}

-   2022-08-22 ◦ [github.com/craftsmandigital/hugo-get-pocket](https://github.com/craftsmandigital/hugo-get-pocket)

    This is a Hugo project that view bookmars from my get-pocket app. Using get-pocket api to generate json to use in website.